[{"Date":"2013-11-21 00:00:00","ID":"950","Feedback":"<p>Late hours are brilliant! Please keep this up!<\/p>","Response":"<p>Thank you for your positive comment regarding the extended hours trial held during October &amp; November.<br \/>\r\n&nbsp;<\/p>","PermissionToPost":"0","ResponseDate":"2013-12-20 12:07:55","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"12","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-11-24 14:46:26","ID":"951","Feedback":"If books have been renewed three times already and a HDR student wants to borrow them longer - why doesn't the library allow this if there are no holds or requests for those items by other patrons?  Frustrating and time consuming to have to return a book and wait for it to go back on the shelves in order to borrow longer - the outcome is exactly the same (the student continues to borrow the book) so why not make it easier for the students?","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; Library Executive Executive decided mid-year to change the loan periods for students.&nbsp;HDR Students will have a nine week loan period.&nbsp;Undergraduates will have a four week loan period. The system changes required to implement the new loan periods will happen over&nbsp;the Xmas break in&nbsp;time for the beginning of&nbsp;first semester 2014.&nbsp;&nbsp;<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"0","ResponseDate":"2013-11-25 09:47:16","Campus":"3","Name":"Lisa","Email":"lbatten@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2013-11-25 21:59:25","ID":"952","Feedback":"At 9.45pm on 25\/11\/13 I realised that I had left my Ipad on the library shelves on the third floor. I phoned the information desk and a staff member who was on at that time sent a colleague to see if it was still there. Thankfully they found it. I have always found the library staff helpful but tonight they went the extra mile, enabling me to get a good nights sleep. Thanks library staff ","Response":"<p>No response as no contact details given or permission to post.<\/p>","PermissionToPost":"0","ResponseDate":"2013-11-26 17:11:33","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-11-26 22:29:35","ID":"953","Feedback":"On 15\/11 I received an email about a book (Managing the information technology resource) being on the holdshelf for pick up. At around 2:30 that day I went into the library to pick up the book which was not on the holdshelf. The librarian informed me to go and check upstairs in the sorting area and on the actual shelf to see if it was there (which it was not).\r\n\r\nI went into the library everyday until the morning of 22\/11 to see if the book had been returned to the holdshelf, which it was not. The previous week before, the library website said that there was a copy on the holdshelf and after going in to look at a diagram in that book, it was not on the holdshelf.\r\n\r\nOn 22\/11 before 4pm, I was walking past the return slot outside the library and saw three guys holding that book about to return it. The book had c.3 on it which was the book that was supposed to be on the holdshelf.","Response":"<p>Thank you for your feedback -<br \/>\r\n&nbsp;<\/p>\r\n<p>We apologise for this inconvenience but unfortunately, it appears that another patron removed the book from the &quot;hold&quot; shelf that was intended for you. They would not have been able to borrow this book formally as it was on hold for you. At least they did return the book to the library but as you pointed out the return of the book was too late for you. This inconsiderate action by some patrons does occur from time-to-time.<br \/>\r\n&nbsp;<\/p>\r\n<p>Lea Beranek<br \/>\r\nCollection Delivery &amp; Facilities Manager<br \/>\r\n&nbsp;<\/p>","PermissionToPost":"0","ResponseDate":"2013-11-27 18:01:03","Campus":"3","Name":"Jacqueline Walker","Email":"jm8walker@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"15","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2013-12-05 11:27:07","ID":"954","Feedback":"Hi, I was wondering if I could get a copy of the following journal article?\r\n\r\nTreating Speech Subsystems in Childhood Apraxia of Speech With Tactual Input: The PROMPT Approach\r\n\r\nIt comes up in a search but then it can't be found when I click on the link.\r\n\r\nPerhaps my feedback would be I am not sure who to contact about this?  Thank you :)","Response":"<p>Hello Mr Atkinson,<\/p>\r\n<p>I have forwarded your email to the relevant Library staff who will contact you very soon<\/p>\r\n<p>Lea Beranek, Collection Delivery &amp; Facilities Manager<\/p>","PermissionToPost":"0","ResponseDate":"2013-12-06 14:34:14","Campus":"3","Name":"Jen Atkinson","Email":"jkatkinson@students.latrobe.edu.au","Telephone":"0439 353 7","Responded":"1","Notes":"","AllocatedToId":"15","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1011","Feedback":"<p>received via Kerryn LRC Mildura survey Dec 2013\r\nAs I live outside of Mildura I spend a lot of my time between classes in the library studying. The staff are always friendly and I love the layout of the library where you can find a nook to do individual study or have group study\/meetings around a table. The only complaint I have is that at times it is hard to study as people seem to congregate in the lounge area to socialise which then causes a lot of noise and at times I and other students have had to go and find another area on the campus to study. Generally this is not a problem however when stressed as we have assignments or exams that we must pass this can cause a bit of frustration and further stress. I love that people get together and chat so could it be that the lounge area needs to move to the other side of the library as there seems to be a lot of spare space there and it would not interrupt those that are trying to study.(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:49:29","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn LRC Mildura survey Dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-06 17:36:13","ID":"956","Feedback":"so i could not get an article to open- the link is here- \r\nhttp:\/\/0-sw.oxfordjournals.org.alpha2.latrobe.edu.au\/content\/28\/1\/12.full.pdf+html\r\n\r\ni spoke with a librarian, (at 5.15pm , on the 6\/12\/13) who after 10 minutes of searching could not even find the fucking article using the search function on the library site.. this was incredibly frustrating, so i hung up on her.. she was very nice and friendly but was unable to help. can you please train your staff to at least know how to perform simple searches using the library search engine..\r\n\r\n","Response":"<p>Responded to the student by email.<\/p>","PermissionToPost":"1","ResponseDate":"2013-12-20 14:28:52","Campus":"3","Name":"Lee Lendvay","Email":"lrlendvay@students.latrobe.edu.au","Telephone":"0405304262","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2013-12-11 11:48:40","ID":"957","Feedback":"Is there any sort of process in place for missing books? I recently returned a book and now it is nowhere to be found, even though the catalogue says it's available. There are other books that I haven't been able to find on the general shelves also.","Response":"<p>Thank yu for your feedback -<\/p>\r\n<p>Please talk to the Library staff at the Inquiry desk.&nbsp; We will ask you to complete a &quot;Missing book form&quot; whereupon we will commence a search for this item - we will keep you informed of the outcome.&nbsp;<\/p>\r\n<p>Lea Beranek, Collection Delivery &amp; Facilities Manager<\/p>","PermissionToPost":"1","ResponseDate":"2013-12-13 14:21:11","Campus":"3","Name":"Dominic Kelly","Email":"d.kelly@latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"15","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-13 16:17:56","ID":"958","Feedback":"I have tried multiple extensions to ask a question on a Friday at 4.15pm but got no answer on any!","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; Are you referring to last Friday 13 December or to Fridays in general?&nbsp; We did have problems with the Bundoora Library phone on the afternoon of Friday 13 December.&nbsp;<\/p>\r\n<p>I apologise for any inconvenience that this caused you.&nbsp; Is there something that I can help you with?<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2013-12-16 10:56:33","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-17 00:17:50","ID":"959","Feedback":"The library doors, they're fixed! Thankyou!","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback on the Library doors which I will pass on to the team who have been planning and working on the change.&nbsp;<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2013-12-17 09:43:46","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-19 12:45:52","ID":"960","Feedback":"The housing of some collections offsite in the annexe slows the research process significantly.\r\n\r\nFor example, I make extensive use of a collection of government publications (Commonwealth Record &amp; Ministeral Document Service) for which no searchable index exists. \r\n\r\nWhen I become aware of an item (eg. speech, press release, etc) that was likely published in this collection I need to oder the entire volume to be delivered from the annexe. This does not typically occour until the next day. \r\n\r\nIf for some reason I revieve the wrong volume (which is a regular occourance due to the way they are numbered) or I realise the volume doesn't contain what I'm after, but another one might,  I then need to wait another 24 hours before that volume is transferred to the library.\r\n\r\nOffsite storage also leads of a loss of senendipity in the research process, when while searching for a known item you stumble across a related useful, but unknown, resource.","Response":"<p>Dear Tim<\/p>\r\n<p>Thanks for your&nbsp;feedback to the Library regarding the housing of&nbsp;low use research materials offsite. We appreciate your frustration with&nbsp;researching&nbsp;a&nbsp;topic which relys on consulting print based Government publications, where indexes do not exist, and citations can be incorrect.&nbsp;<\/p>\r\n<p>Did you know that the Annexe has a comfortable study accommodation for researchers who wish to make an appointment to consult long runs of titles?&nbsp; Long Government publications runs can also be requested from the Annexe and within 24 hours they might be viewed in the convenience and comfort of the refurbished study areas in the Library.<\/p>\r\n<p>I encourage you to inquire about this service if you ever have large amounts to consult, over a few weeks. This may minimise the need for numerous requests, with the wait in between.<\/p>\r\n<p>The Library only moved the Government Publications collections after careful planning and consultation with the academic community. The Library staff met with staff in every faculty to explain the collection moves and to ask if any specific titles needed to be kept onsite.&nbsp; Quite a few volumes were retained on open access, however, the titles you mention were not ones we were asked to keep in the main building.&nbsp;<\/p>\r\n<p>Thanks again for taking the time to comment on the problems you have been having.&nbsp; Please feel free to get back to me, or to your Faculty librarian&nbsp;if there are&nbsp; other problems you are encounter.<\/p>\r\n<p>Regards<\/p>\r\n<p>Eva<\/p>\r\n<p>Eva Fisch<br \/>\r\nCollection Development Manager<br \/>\r\n&nbsp;<\/p>","PermissionToPost":"1","ResponseDate":"2013-12-20 11:55:45","Campus":"3","Name":"Tim Hamilton","Email":"ta2hamilton@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"16","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-01-09 15:36:39","ID":"961","Feedback":"It's time to pay the ferryman.","Response":"","PermissionToPost":"0","ResponseDate":"2014-01-13 09:59:27","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"No response required. JD","AllocatedToId":"12","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-01-14 12:51:53","ID":"962","Feedback":"Hi you have a broken link on the page:\r\nhttp:\/\/www.latrobe.edu.au\/library\/teaching-services\/study-and-meeting-spaces\r\n\r\n- the link if for training and it currently points to \r\n\r\nhttp:\/\/www.latrobe.edu.au\/ctlc\/workshops\/workshop_detail.php?fldWorkshopID=77http:\/\/www.latrobe.edu.au\/ctlc\/workshops\/workshop_detail.php?fldWorkshopID=77\r\n\r\nCheers\r\nmike","Response":"<p>Hi Mike, Thank you for reporting this to us.&nbsp;The link has now been updated. The link you are after is: http:\/\/tlweb.latrobe.edu.au\/ctlc\/interim\/workshops\/workshop_detail.php?fldWorkshopID=77<\/p>\r\n<p>I have been advised by CTLC that there are currently no sessions but if you get in touch with Joseph Hayes or Trevor Wood from CTLC, they can arrange an ad hoc session for you.<\/p>\r\n<p>Sincerely, Eng Ung<\/p>\r\n<p>Web Coordinator.<\/p>","PermissionToPost":"1","ResponseDate":"2014-01-22 15:08:57","Campus":"3","Name":"Mike","Email":"m.harbour@latrobe.edu.au","Telephone":"","Responded":"1","Notes":"updated broken link","AllocatedToId":"4","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-01-18 10:37:20","ID":"963","Feedback":"where is the bonus search? when using the mobile version of the website... :(","Response":"<p>Hi Ms. Brueggemeier,<\/p>\r\n<p>Thank you for your bringing this issue to our attention. We will look into adding a Bonus+ link on the mobile version of the website. In the meantime, here is the direct link to Bonus+: http:\/\/bonus.newcastle.edu.au\/<\/p>\r\n<p>We thank you for your patience while we look into adding this feature to our mobile version of the catalogue.<\/p>\r\n<p>Sincerely,<br \/>\r\nEng Ung<br \/>\r\nWeb Coordinator<\/p>","PermissionToPost":"0","ResponseDate":"2014-01-22 15:27:00","Campus":"3","Name":"jan brueggemeier","Email":"jan@neture.org","Telephone":"","Responded":"1","Notes":"1. emailed lynette to ask if bonusplus can be added to mobile version of catalogue\/search","AllocatedToId":"4","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-01-20 16:34:32","ID":"964","Feedback":"Hi broken link on http:\/\/www.latrobe.edu.au\/library\/teaching-services\/study-and-meeting-spaces - I was looking to follow the link to the required av training. \r\nYou should have received training before using the library equipment.\r\n\r\nComes up with a broken link. Happy to undertake any training required, just need to know what it is. \r\n\r\nCheers\r\nmike\r\n","Response":"","PermissionToPost":"1","ResponseDate":"2014-01-22 15:00:04","Campus":"3","Name":"Mike","Email":"m.harbour@latrobe.edu.au","Telephone":"3479","Responded":"1","Notes":"1. sent email to ctlc for correct link","AllocatedToId":"4","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-01-29 20:16:26","ID":"965","Feedback":"Dear Library, \r\nI am a post graduate student (Masters Musculoskeletal Physiotherapy) and I attend the Bundoora Library on the weekends (such as last Saturday) to find extra time to study away from the bustle of home.\r\nI would like to know why the library has now changed its Saturday and Sunday opening hours to 1pm as opposed to 9:30am currently? (as it will change my current study habits) \r\nThank you \r\nAndrew","Response":"<p>&nbsp;Hello,<\/p>\r\n<p>Thank you for your feedback. &nbsp;These opening hours are for February. &nbsp;2014 Opening hours are being finalised and will be posted on the website as soon as possible. &nbsp;The proposed weekend opening hours are 9.30 am - 5.00 pm on Saturday and Sunday.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"0","ResponseDate":"2014-01-31 11:46:39","Campus":"3","Name":"Andrew Kwok Wai Lou","Email":"aklou@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-01-30 11:58:23","ID":"966","Feedback":"Hi,\r\nI would just like to lodge a complaint.\r\nI was working on the top floor of the library on the &quot;silent&quot; level today, working on a deadline for an important essay due very shortly and under intense pressure. Unfortunately a tour conducted by library staff was only 5 meters or so from the desk I was working at and was particularly noisy. When I kindly asked if the staff member would please keep the noise down, I was rudely told &quot;Yeah, I know, I'm doing a tour&quot;, no apology, just rudeness and ignorance. I was not impressed. Why are staff exempt from this rule?\r\n\r\nRegards,\r\nRichard","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; I have spoken to staff who lead the yesterday's tours.&nbsp; The participants in one of the tours included two students in wheelchairs.&nbsp; The tour leader of this group kept the participants close to the lift, for reasons of access,&nbsp;and gave her introduction to the group at that location rather than in the usual location close to the reshelving area. I assume that you were sitting near the lift.&nbsp; Staff will use the reshelving&nbsp;area in future for tours.&nbsp;This area is located away from study carrels.&nbsp;<\/p>\r\n<p>I understand your frustration and disappointment&nbsp;and I apologise.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"0","ResponseDate":"2014-01-31 12:14:19","Campus":"3","Name":"Richard","Email":"rjdean@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-01-30 13:43:04","ID":"967","Feedback":"Hi there\r\n\r\nI was hoping to access extended hours on Friday, 16 January.  I am now aware that extended hours are not happening until 3 March. \r\n\r\nThis is no problem to me, but there was a sign saying &quot;You must re-register for extended hours in 2014.&quot;   There was no signage to let us know that extended hours are not currently on.  This is in contrast to December, when signs made it clear around Christmas that extended hours were not operating. \r\n\r\nThe signage was misleading, on Friday 16 January.  I actually was treated rudely by the security guard, while trying to re-register for extended hours though I have raised this separately, with security. \r\n\r\nGiven that the library has managed to erect a large sign explaining the 'ins &amp; outs' of the recent door changes (probably slight overkill, but never mind) I would think you could see your way to clear signage re. extended hours. \r\n\r\nHappy to further discuss if required; \r\n\r\nMany thanks\r\n\r\nLINDA  HADLEY\r\n\r\nPh.: 0405 356 170","Response":"","PermissionToPost":"0","ResponseDate":"2014-02-03 09:22:40","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"Feedback forwarded to Andrew and Virginia for investigation.","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-02-05 18:56:55","ID":"968","Feedback":"Not sure if this is the right place to feed back, as my comments are not only about the library, however, I find the new website really terrible to use.  For a start, it looks very amateurish (like a badly-designed phone app), and I find it really hard to find things.  I'm now an alumnus, not a current student (finished Masters last year), and am so glad the site changed just after I completed my study.  thanks, Cecily","Response":"<p>&nbsp;Hello,<\/p>\r\n<p>Thank you for your feedback. &nbsp;I have forwarded your feedback to the University team responsible for the La Trobe website.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-02-06 09:31:50","Campus":"3","Name":"Cecily Walker","Email":"cm2walker@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"Feedback sent to Judith Evans","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-02-05 22:00:15","ID":"969","Feedback":"Hi,\r\nI'm not sure if this is the appropriate forum for this query, but here goes.\r\nI am trying to logon to the Latrobe Library database (To access education journals) but can't get on. \r\nMy alumni no. is 101399582399 Name: Willemyntje (Willie) Alblas\r\nemail: williealblas@hotmail.com\r\n\r\nI have tried to logon as &quot;other user&quot; and haven't used spaced between numbers. Not sure what else to do.","Response":"","PermissionToPost":"0","ResponseDate":"2014-02-06 11:51:03","Campus":"20","Name":"Willie","Email":"williealblas@hotmail.com","Telephone":"","Responded":"1","Notes":"Emailed the student.","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-02-08 12:08:50","ID":"970","Feedback":"Hello\r\nMy suggestions are about the library website rather than the campus library itself.\r\nIn logging in while on the library website (eg: My Library and when searching the catalogue) we can't hit enter on our keyboard to login, we have to physically click the &quot;Submit&quot; link. While this seems trivial, it is rather annoying, and after 4 years at LTU I thought I'd say something. It would be much appreciated if this could be changed!\r\nThe other suggestion is that when in &quot;My Library&quot;, it would be great if the books we have borrowed could be listed by due date (soonest due to latest due) rather than all over the place. I have on occasion had books out with multiple due dates and on scanning the list for which ones were due missed one and had to take another trip to uni to return it (not nice when you live 2 hrs away). It would be great if you could implement this too.\r\nThanks in advance, and I look forward to reading your response!\r\n","Response":"<p>Hi Bronwyn, Thank you for taking the time to submit feedback. We have noted your suggestions and will look at the feasibility of making these changes.<\/p>\r\n<p>Eng Ung <\/p>\r\n<p>Web Coordinator<\/p>","PermissionToPost":"1","ResponseDate":"2014-02-11 12:23:29","Campus":"3","Name":"Bronwyn","Email":"bmwoff@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"sent email to lynette for investigation. 11\/2","AllocatedToId":"4","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-02-20 12:58:29","ID":"971","Feedback":"Drinking fountain located on the 1st floor, west wall heading towards ground floor bathrooms is at an annoyingly clumsy height.\r\nThe position and height of the drinking spout is difficult to get to, as the area immediately surrounding the drinking spout is rather tight and narrow. This can and has resulted in someone banging their head into the steel surround. Sheepishly, I will admit that this is not a theoretical situation, as I have just clangged my head on this particular piece of equipement.\r\nThe problem as far as I see it is that the alcove is too small, and does not allow a comfortable reach in with ones head.\r\nPlease pass this message on to Andrew or Kevin, or whom ever is in charge of facilities and also OHS.\r\nThanks. ","Response":"<p>Thank you for your suggestions in relation to the drinking fountain<br \/>\r\nWe will review the set-up of this facility based on your feedback <br \/>\r\n&nbsp;<\/p>\r\n<p>Lea Beranek, Collection Delivery&nbsp;&amp; Facilities Manager<br \/>\r\n&nbsp;<\/p>","PermissionToPost":"0","ResponseDate":"2014-02-20 13:14:41","Campus":"3","Name":"Saverio Lo Giudice","Email":"saverio.logiudice@learning.latrobemelbourn.edu.au","Telephone":"0422455932","Responded":"1","Notes":"","AllocatedToId":"15","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-02-24 10:43:49","ID":"972","Feedback":"Yes, just a comment. I sometimes watch dvds in the library in the AV area. To do so, I borrow the pack containing headphones, vcr remote control and tv remote control. I have earplugs of my own, so I only need the tv remote control to turn the tv on and off. Why not hasten the process by allowing us to simply borrow the tv remote control? University students are fairly self-contained and resourceful, you know. ","Response":"<p>Thank you for your feedback<\/p>\r\n<p>We will certainly consider you suggestion<\/p>\r\n<p>Lea Beranek, Collection Delivery &amp; Facilites Manager<\/p>","PermissionToPost":"1","ResponseDate":"2014-02-24 18:35:13","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"15","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-02-25 07:15:44","ID":"973","Feedback":"Fresh Juice Unlike bottled varieties, hedging binary options freshly juiced fruits and vegetables., &lt;a href=&quot;http:\/\/num1sverigeonlinecasino.eu\/&quot;&gt;online casino bonus&lt;\/a&gt;, [url=&quot;http:\/\/num1sverigeonlinecasino.eu\/&quot;]online casino bonus[\/url],  11440, ","Response":"<p>spam<\/p>","PermissionToPost":"0","ResponseDate":"2014-02-25 09:56:11","Campus":"11","Name":"Soagkogr","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-02-27 14:51:03","ID":"974","Feedback":"I'm not happy with the lack of extended opening hours by the library.  Why have these been scaled back from being open all night to merely 10pm?  As far as I can tell the library was extensively used all night by students to as far as students complaining that there was not enough places to study during the night at some periods.  I could be mistaken but I cannot find any information regarding extended hours or any way to register my card for access.","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; The Library is currently undertaking a review of opening hours. The hours shown on the website are the interim opening hours for the first weeks of semester, 2014. Once the outcome of the review is finalised, we will publish opening hours for the remainder of the semester.<\/p>\r\n<p>Extended hours during the review are 10.00 - 12.00 pm.&nbsp; All three floors of the Melbourne Library are open during extended hours. The registration form is available on the website under Quick Links - Request forms.<\/p>\r\n<p>As part of the review the Library has carefully considered 2013 usage of the Library between midnight and 7.00 am.&nbsp; Usage is measured by the number of&nbsp;unique student ID&nbsp;card&nbsp;&nbsp;swipes to&nbsp;enter the building.&nbsp;For your information, the 2013 &nbsp;daily usage per month: March&nbsp;= 52, April = 69, May = 106, June (exams) = 197, July - 37, August 65, September 99, October =&nbsp; 73, November (exams) = 188.<br \/>\r\n&nbsp;<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-03 10:30:14","Campus":"3","Name":"Elise","Email":"ecireland@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-02-28 17:19:00","ID":"975","Feedback":"Students without internet at home are struggling to find enough hours when computers are available to watch lectures and complete subjects in blended or online modes.   \r\n\r\nThere is an equity issue with Melb &amp; Bendigo students having much more access on evenings and weekends to Uni computers than AW students.\r\n\r\nI have put this into CADC as an agenda item, because I know it is larger than the library.","Response":"<p>Hello Susan,<\/p>\r\n<p>Thank you for your feedback.&nbsp; We are carefully considering the 2013 usage (numbers of people in the library)&nbsp;of the Wodonga Library between 7.00 pm and 9.00 pm&nbsp;as part of&nbsp;the review of opening hours.&nbsp;<\/p>\r\n<p>For your information, the daily usage (numbers of people in the building) between 7.00 and 9.00 pm in 2013 was March = 6, April = 6, May = 5, June = 7, July = 1, August = 10, September = 8 and November = 6.&nbsp;<\/p>\r\n<p>Please contact me if you wish to discuss your concerns in more detail.<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-03 09:58:50","Campus":"1","Name":"Susan Lawler","Email":"s.lawler@latrobe.edu.au","Telephone":"9874","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-02 09:52:51","ID":"976","Feedback":"It's very annoying that you don't answer the phone on weekends when you are supposedly open. I live an hour drive away and I needed to clarify an error regarding a loan with you before I made the trip. Otherwise it may have been a wasted trip. Not helpful. Answer the phones when you're open or put a message  on saying that you're not answering the phones.","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; The Library service desk is open 1.00 - 5.00 pm on Saturday and Sunday for the next two weeks while the Library is undertaking a review of opening hours. The hours shown&nbsp;on the Library's&nbsp;website&nbsp;are the interim opening hours for the first weeks of semester, 2014. Once the outcome of the review is finalised, we will publish opening hours for the remainder of the semester. The webpage for the opening hours provides the hours of the service desk.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-03 10:15:28","Campus":"3","Name":"Pam","Email":"pamela_joan@aapt.net.au","Telephone":"98796974 \/","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-03 12:21:20","ID":"977","Feedback":"Hi\r\nI'm an international student and living in a house with seven people which unfortunately 5 of them don't understand what is studying.\r\nWould you please consider this and let us to study in the library 24\/7 or at least more extended time?\r\nI would really appreciate any help.\r\nKind Regards,\r\nVahab","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; The Library is currently undertaking a review of opening hours. The building opening hours and service desk hours shown&nbsp;on the website&nbsp;are the interim opening hours for the first weeks of semester, 2014. Once the outcome of the review is finalised, we will publish opening hours for the remainder of the semester.&nbsp;<\/p>\r\n<p>Please note that during the review&nbsp;the Bundoora Library building is open from 7.00 am - midnight, Monday - Friday; that's&nbsp;seventeen hours per weekday.&nbsp;<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-03 15:11:42","Campus":"3","Name":"Vahab","Email":"vahab.bandari@yahoo.com","Telephone":"0478122408","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-03 22:29:10","ID":"978","Feedback":"Hi,\r\n\r\nI keep reading about the review of opening hours.\r\n\r\nI was wondering, what exactly is being reviewed? Will we have an explanation of why times are changed if they are in fact changed?\r\n\r\nI understand you have said that the library is open for 17 hours of the day, however, many people work all day. You then need a break after 5pm before starting your studies, so let's say you get started at 7-8. That leaves 4-5 hours to study, which understandably sounds like a lot, but in reality, it is not.\r\n\r\nMy main question is why is the review being undertaken and what is it involving? Does it involve feedback from students or is it going to be a purely financial decision?","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback. In 2013, the Library commenced an internal service delivery review and a review of opening hours was part of this service delivery review. The review was conducted within the context of Future Ready, the University&rsquo;s strategic vision and goals. The review included:<br \/>\r\n&nbsp;<\/p>\r\n<p>&bull; consideration of current services. Were they relevant, still needed? How could they be improved? What services were no longer needed? <br \/>\r\n&bull; identification of new services that would contribute to the University&rsquo;s Learning and Teaching, and Research plans<br \/>\r\n&bull; consideration of staffing resources required to deliver ongoing and new services<br \/>\r\n&bull; trials of extended opening hours at Mildura - opening on Sunday afternoons and at Bendigo - opening until midnight Monday &ndash; Thursday during semester. <br \/>\r\n&bull; analysis of student feedback and survey data to identify issues, themes and trends pertaining to customer service.<br \/>\r\n&bull; analysis of statistics by hour, day, week and month &ndash; usage of services, number of queries, usage of library buildings and facililties<\/p>\r\n<p>As a result of this analysis, new opening hours were proposed to ensure that we have opening hours which are consistent with demonstrated student demand. The Library has consulted a range of stakeholders across the campuses regarding the opening hours. These consultations have included the student unions at Wodonga, Bendigo and Melbourne. This week the&nbsp;University Librarian is meeting with representatives from the Melbourne Student Union to discuss their feedback and suggestions.<\/p>\r\n<p>I encourage you to submit any comments that you would like considered as part of the review via the Feedback link on the Library website or by email to me.<\/p>\r\n<p>Best wishes,<br \/>\r\n&nbsp;<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-05 10:45:31","Campus":"3","Name":"Jon","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-07 10:06:28","ID":"979","Feedback":"Does the library have a legal responsibility to make the collection of books (a university asset) secure? At the moment it is not secure. At the times when the service desks are unstaffed it is very easy to steal books. Can anything be done about this?","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; Yes, the Library has a responsibility to keep assets such as books secure. Any unborrowed book will set off an alarm if the book is taken from the building.. When the service desk is staffed, Library staff are expected to respond to the alarm and check that books have been borrowed. When the service desk is not staffed, security staff on duty are trained by library staff to fulfil this function. At Melbourne, two guards are on duty after hours and are able to watch the exit doors and respond to any alarms. Our aim is to purchase electronic books where possible; this not only increases access to the books for students, but also removes the issue of books going missing.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-11 10:04:33","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-08 10:03:42","ID":"980","Feedback":"Hi,,\r\nI am writing in regards to the new opening hours of the library. I would recommend to stay with the 24 hour opening time, especially during assignments submission and exams preparation periods. Firstly, as a worldly ranked university, La Trobe Uni should have an accessible library as the basic facility that students can make use of at anytime. Moreover, as this university highly values the diversity and multiculture on campus, students' needs of using the library should be carefully considered, including those are not in the majority. There are students who don't have a study space in their accomodatin, who want to come to the library after work, etc. In addition, the tuition fees increase by 7% annually and because of this, we expect the university to maintain its current services as at the time we enrolled.\r\nThank you for your time,\r\nBest regards.","Response":"<p>Hello,<br \/>\r\n<br \/>\r\nThank you for your feedback. I notice from your feedback that you do not have a La Trobe email address.&nbsp; Are you a La Trobe student?<\/p>\r\n<p>The Melbourne Library is open until midnight, seven days a week. During the week, the Library opens at 7.00 am. In total, the Library is open seventeen hours a day Monday &ndash; Friday. During peak periods, such as the weeks leading up to exams, the Library will consider opening longer hours. <br \/>\r\n<br \/>\r\nThe La Trobe Library opening hours are very similar to other Victorian university libraries. RMIT and Monash are open 8.00 am &ndash; midnight on weeknights. Melbourne University and Victoria University are open 8.30 am &ndash; 10.00 pm. <br \/>\r\n<br \/>\r\nPlease contact me if you would like to discuss your concerns in more detail.<br \/>\r\n<br \/>\r\nBest wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-11 14:23:08","Campus":"3","Name":"","Email":"nhi.ashtoncollege@gmail.com","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-09 00:08:50","ID":"981","Feedback":"Respected Sir\/Ma'am,\r\nI had used the self check out machine to issue a book, but i was unsuccessful in issuing one. but later that day a book was issued on my name. I did not issue any book on my name. The details of the book are in the link https:\/\/alpha2.latrobe.edu.au\/record=b2159590~S5\r\nPlease let me know as what can to be done regarding this. i will be thankful to you.","Response":"<p>Hello,<\/p>\r\n<p>Please contact the Library Inquiry desk to discuss this issue - or call Sami Bagdas directly on 03 9479 1127<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-11 13:48:25","Campus":"3","Name":"Mudit","Email":"darbhangamudit@gmail.com","Telephone":"0451380703","Responded":"1","Notes":"","AllocatedToId":"15","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-09 10:23:00","ID":"982","Feedback":"It's great to see that hours are being extended (finally), but take it seriously. No staff present on weekends until 1pm - not good enough. ","Response":"<p>Thankyou for your feedback<\/p>\r\n<p>The Library continues to review opening hours and library services, providing&nbsp;library access for extended hours has been achieved at the Bendigo Campus and has been&nbsp;a result of feedback from students about what they saw as a need.&nbsp; Your feedback regarding serviced hours will be considered as part of the ongoing review of opening hours.<\/p>\r\n<p>Jeanette Dazkiw, Campus Library Manager<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-10 14:37:05","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"12","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-09 10:31:59","ID":"983","Feedback":"For Bendigo campus, but can be applied to all LTU campuses:\r\n\r\nWhy not have a 24 hour system like that of Charles Sturt University? Student swipe cards allow access into a 24\/7 area that has access to computer and printing facilities and also self-checkout of any books (excluding reserved items).\r\n\r\nAlso, perhaps you should review the system for checking out hold-shelf items - since they aren't reserved then students should be able to check these items out themselves!","Response":"<p>Thankyou for your feedback<\/p>\r\n<p>The Library is still reviewing library hours across all campuses and continues to monitor library usage.&nbsp;At Bendigo we are currently&nbsp;opening the library for significanty extended hours compared to 2013 as result of student feedback.&nbsp; We hope this will provide a much improved opportunity for students studying here.&nbsp; The physical books can be borrowed using the self check machine and yes we are looking at installing an additional self check machine within the next couple of months to address issues such as hold shelf items.&nbsp;<\/p>\r\n<p>Jeanette Dazkiw Campus Library Manager<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-11 12:20:56","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"Edited response to fix keying errors","AllocatedToId":"12","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-10 15:41:34","ID":"984","Feedback":"I liked it when you could search for Reserve listings with the Catalogue search by subject code, why on earth would you get rid of that??\r\nAlso the computers in the Reserve area are not restricted to catalogue searches, I was waiting for a long time and never got to go on one of them because two students were doing study on there, please change this, I mean it's not even a sitting area, or at least have time restrictions","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; The Library is replacing the current library management software.&nbsp; This includes the current library catalogue software.&nbsp; The University has adopted a new system to manage reserve and reading lists.&nbsp; The best place to access your readings is via your LMS subject page.&nbsp; Alternatively, you can search for your readings by clicking on the reading lists link on the Library home page.<\/p>\r\n<p>I have passed on your feedback re the reserve area catalogues to the manager responsible for this area.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-11 10:47:30","Campus":"3","Name":"Seth McDonald","Email":"sa8mcdonald@students.latrobe.edu.au","Telephone":"0425757597","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-13 16:17:04","ID":"985","Feedback":"Re Library\r\nI am saddened to not be able to use the photocopier.  Perhaps a scanner could be allowed. It certainly stiffles academia for visitors and when given with no warning it is not quite charitable. We teach if we listen and respect and avoid relatavism to avoid chaos.We live in tough times but it is regional here so it is very difficult when things change quickly.\r\n","Response":"<p>I think there may have been a misundertanding as visitors to the Albury-Wodonga library do have access to photocopy facilities.&nbsp; Visitors to the Library are able to use the photocopier by purchasing a casual print card from the machine in the photocopy room. The copier in that room can also scan to a USB for you.&nbsp; Please ask the desk staff for assistance.<\/p>\r\n<p>Regards,<br \/>\r\nLinda Sheridan<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-13 16:45:58","Campus":"1","Name":"BE ROB JJM","Email":"robchasba@gmail.com","Telephone":"0000000000","Responded":"1","Notes":"Have spoken in person to the sender","AllocatedToId":"11","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-13 18:53:32","ID":"986","Feedback":"Thank you.\r\nLast year we were able to use the library computer for university work from another university and then print using a USB as pdf. This was a bit slower but appreciated as a distance student. Other facilities are limited for students as municipal library limits time to one hour on computer.Printing there is much more expensive and Office Works is a long way and not as convenient for one stop as Latrobe for internet. Please consider allowing access at Latrobe  again like last year. Or give us notice to readjust and not start til next semester as you do review. Consider similar hours with your helpful staff and student supervisors. We need to listen to teach and help service with our powers says Pope Francis.","Response":"<p>Thank you for your feedback.&nbsp; Our ICT staff are currently working on a solution so that we can once again offer guest access to a computer in the Library.&nbsp; Unfortunately until a solution is found, we are unable to offer computer access, although there is still access to our other facilities.<\/p>\r\n<p>Opening hours for the Albury-Wodonga campus are still under review for this year. I will certainly &nbsp;forward your comments on to be considered with the other feedback received.<\/p>\r\n<p>Regards,<br \/>\r\nLinda Sheridan<br \/>\r\nCampus Library Manager<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-14 12:50:06","Campus":"1","Name":"BR ROB JJM","Email":"robchasba@gmail.com","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"11","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-14 19:32:06","ID":"987","Feedback":"Really appreciate the new library hours. Helps those who work full time and study part time. Hopefully these hours will become permanent. Thank you!","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; We plan to make an announcement re the 2014 opening hours within a week or so.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-17 09:58:41","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-15 17:17:39","ID":"988","Feedback":"Hey guys\r\n\r\nSearching for a book and this link comes up\r\n\r\nhttp:\/\/ez.library.latrobe.edu.au:2057\/patron\/NoAccess.aspx\r\n\r\nWondering what's happening, lecturer said you guys are supposed to have an online edition and the search engine pops up with one available but I cannot access it\/","Response":"","PermissionToPost":"1","ResponseDate":"0000-00-00 00:00:00","Campus":"3","Name":"Seth McDonald","Email":"sa8mcdonald@students.latrobe.edu.au","Telephone":"0425 757 5","Responded":"0","Notes":null,"AllocatedToId":"17","PostedOnline":"0","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-17 14:54:05","ID":"989","Feedback":"Hi, Im enjoying the use of post-grad study areas but im finding the reflection of the lighting in the ceiling  (Level 2) very distracting on my device\/notebook.  Is there anyway the lighting can be deflected - the lighting is positioned directly over the desks. Thanks","Response":"","PermissionToPost":"1","ResponseDate":"0000-00-00 00:00:00","Campus":"3","Name":"Ruth","Email":"rrawlings@students.latrobe.edu.au","Telephone":"","Responded":"0","Notes":null,"AllocatedToId":"22","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-17 22:54:02","ID":"990","Feedback":"well,,you cut the library hours a lot this year,,cant you at least close at 1 or 2 am??","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp;The review of opening hours has ended.&nbsp; The hours for semester one will be published on the Library website soon.&nbsp; The Library team are considering extending opening hours during peak periods such as exams.&nbsp;<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-18 10:11:20","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-18 00:00:00","ID":"991","Feedback":"<p>I would like to mention that the extended library hours (Mon-Thurs til midnight) was very very useful and important & helped me to do well in last semester's exams. For us with small\/young children at home and several part-time jobs it is essential that there is a quiet study place open very late & so sorely needed.<\/p>","Response":"<p>Thank you for your feedback about library hours.<br \/>\r\nWe hope the current extended access to the library during the academic year will be well utilized further by students and supports students with work and family commitments.<br \/>\r\n&nbsp;<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-18 16:49:42","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"12","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-18 00:00:00","ID":"992","Feedback":"<p>The Research Study Lounge is fantastic! I hope there is a lot of interest and use. Thanks.<\/p>","Response":"<p>Thank you for your feedback. It's great to hear such positive feedback about the new &quot;Research Study Lounge&quot; on level 3. We also hope it is well utilized by research students and staff.<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-18 16:53:47","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"12","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-18 00:00:00","ID":"993","Feedback":"<p>IT help desk moved to library.<\/p>","Response":"<p>Thank you for your feedback. The student IT Help Desk is located on level 1 of the Student Association floor. Unfortunately at this time we are unable to locate IT Help in the library.<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-18 16:59:42","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"12","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-18 00:00:00","ID":"994","Feedback":"<p>Please subscribe to Imprint Magazine www.printcouncil.org.au Excellent magazine for printmakers.<\/p>","Response":"<p>Thank you for your suggestion. The library does currently subscribe to the magazine &ldquo;Imprint&rdquo;. We hold from volume 1 (1966) onward. This journal can be located on the Periodical shelves (level 3) at PR 760 IMPR<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-21 11:12:47","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"12","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-19 14:17:08","ID":"995","Feedback":"I wished to scan twenty pages from a reserve item to a PDF file. I tried to use the scanner on Level 2, but it produced an error message saying I should see an attendant. After waiting in line at the single IT support officer on the ground floor for several minutes, I was told to use either the flatbed scanner or the other MFD on the ground floor. There were queues for both, and I chose the flatbed. However, upon opening the software, it became apparent that one could only save files as images, and not combine them into PDFs. I waited in the other queue for the MFD, only to be met with the message that my account was locked and that I should see an attendant. I queued again for IT support, only to be told that I would have to wait ten to fifteen minutes, and that the scanner and photocopier services were overseen by a different area. Since an hour had elapsed since I entered the library, I gave up my attempt to scan the document. I found the staff I dealt with pleasant, and their responses were accurate, if not particularly useful.\r\nI observe that the previous institutions I attended had standardised all their photocopiers to be MFDs, allowing students to print, scan and copy from any device in the library.\r\nMy questions are:\r\nAre two MFDs and one ageing flatbed scanner sufficient for La Trobe's only library, especially in light of the tendency for students to prefer to scan readings rather than photocopy them?\r\nIs one IT officer sufficient to meet the needs of the many students that use the library at any one time?","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; I'm sorry that you had such a frustrating experience.&nbsp;<\/p>\r\n<p>There are 8 printers, 11 copiers and 2 MFDs located in the Melbourne Library.&nbsp; These resources will be reviewed at the end of first semester to determine what needs to be replaced and to ascertain if we have the right mix of equipment.&nbsp; I will ensure that your comments are considered as part of that review.&nbsp; You may want to contribute additional information to the review.&nbsp; You can do this by submitting feedback or by emailing me.<\/p>\r\n<p>Library staff, who are usually in attendance in the Tech Zone on level one of the Library,&nbsp;are available to assist students with printing, copying and scanning.&nbsp; The IT Student support service is managed by ICT.&nbsp; I forwarded your feedback to her.&nbsp; Unfortunately, the service was short staffed that day due to an unexpected absence.&nbsp; She apologises for any inconvenience that you experienced.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The ICT Student Support service is not managed<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-20 11:41:37","Campus":"3","Name":"Alexander O'Sullivan","Email":"17869297@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"22","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2013-11-04 00:00:00","ID":"996","Feedback":"<p>Courtney Fluffy Daly (passed on by Lea via email)\r\nJust wanted to let everyone know about the library's response RE: the 3rd level computer bandit, \r\nAfter my complaint (posted here a few days ago) they emailed me right back saying they had passed on my message to the security guard and that he would patrol the area. \r\nThe next day, I came in at about 10am, and sure enough the same spot was being reserved with 'stuff', every 20 minutes the security guard came up with my complaint printed out in his hand, and took notes recording what time he came up and checking that no one was ever there. after about an hour and a bit, the security guard came up with another guard plus one of the IT guys and they took all his stuff and logged him out so that a waiting student could use it. \r\nI sent them back an email saying how appreciative I was that they had taken my complaint seriously and responded to it effectively the next day! \r\nMy faith in the library has been restored. Not the students however\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:42:35","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"(passed on by Lea via email) ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-11-01 00:00:00","ID":"997","Feedback":"<p>Feedback from Philip Broadbridge (via Lea in email)\r\nManagement of quiet study areas. Report from FSTE: \"Students were affected by the amount of noise made in the quiet study areas as this prevented them from being able to focus and study.  When asked if the student has been to the quiet research areas it was found the student has not. The student had been affected by the noise in the quiet study area as well as the collaborative area. The student was asked to email the details to Philip Broadbridge so that he could take it up with the library committee.\"  I asked the student if she had asked library staff for assistance. She claims that she did so, but library staff said that there was nothing that they could do.<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:45:15","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"(via Lea in email)","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-11-01 00:00:00","ID":"998","Feedback":"<p>From Philip Broadbridge FSTE (via email from Lea)\r\n2.\tSecurity in Closed Reserve Area.  Email from student : \"Dear sir, \r\nFollowing my brief discussion with you last night, I have consulted some friends, who acknowledge the problems of illegally taking books out of Closed Reserve. From their concerns, I have summarised some issues as below: \r\n\r\n1. Each student account can only borrow the maximum of 3 books in Closed Reserve. If a student borrow the 4th book, scan it to the machine, no transaction is recorded. However, if that student goes through the secutiry gate with that uncheked-out book, there is no alarm. \r\nIt means that book is stolen and there is no record of student's ID, so the university does not know and cannot catch the borrower.\r\n\r\n2. Another way is to cover the barcode of the book by a metal material in order to prevent the alarm at the security gate.\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:47:54","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":" (via email from Lea)","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-11-20 00:00:00","ID":"999","Feedback":"<p>Via email from Jenny Peasley\r\nMy name is Stephen Sim and I enrolled in August to pursue my PhD. One of the most delightful experience so far was learning from the librarians.\r\n\r\nI wish to commend your staff Nicole Sackers has been outstanding and exemplary in her work. I really appreciate her patience and care she shows in providing the best service.\r\n\r\nShe is very proactive and provides an excellent attitude and has given me many insights that will be helpful in my work and she follows through what was noted and asked.\r\n\r\nThanks and kind regards\r\n\r\nStephen Sim\r\nPhD Student\r\nDepartment of Management | La Trobe Business School\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:40:55","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"Via email from Jenny Peasley","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-11-22 00:00:00","ID":"1000","Feedback":"<p>from Karl Brown (via email from Kerryn)\r\nSubject: Library Membership for Alumni\r\n\r\nHi all,\r\n\r\nAt the alumni seminar which my colleagues and I ran in the city last night, I was chatting to two current LTU students\/alumni who were saying how thrilled they were that weâ€™re offering this service.\r\n\r\nOne of them, who has already studied with LTU before and is now studying a postdoctoral equalisation, mentioned that international students who sheâ€™d taught, had gone back to Vietnam but, because they are now able to continue their learning thanks to this service, they are seriously considering further study with La Trobe!  So not only is this offer aiding us in building stronger relationships with our alumni, itâ€™s also playing a part in recruiting alumni as future students too!\r\n\r\nCheers,\r\n\r\nKarl Brown\r\nAlumni Relations Coordinator \r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:37:58","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":" (via email from Kerryn)","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-18 00:00:00","ID":"1001","Feedback":"<p>From Graziella Cristiano (via email from Eva after she had answered query)\r\nHi,\r\nI'm a La Trobe Uni student and I want to read an italian book called 'I Giovedi della Signora Giulia' by Piero Chiara.\r\nIt is not in your catalogue. Can I borrow it from another Victorian university library?\r\nCan you recommend something for me to do?\r\nRegards,\r\nGraziella\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:35:00","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"(via email from Eva after she had answered query)","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-09-01 00:00:00","ID":"1002","Feedback":"<p>from Chat related to Alumni access to DBs Sep 1 - Oct 19,2013 via Eva 20\/12\r\n16:28:18 Kathy: Hi. How can I help you?\r\n16:28:19 Travis: howdy\r\n16:28:39 Travis: I'm an Alumni user - first time trying to access online databases and having problems.\r\n16:29:03 Travis: Keep getting \"403 Forbidden\" when I try and get to anything online (like http:\/\/0-ejournals.ebsco.com.alpha2.latrobe.edu.au\/home.asp)\r\n16:29:19 Travis: also tried ISI and a few random others, same result.\r\n16:30:09 Kathy: Hello Travis. To access the database you will need to first authenticate yourself by using your University ID and Library PIN which was provided when you became a Library Alumni member. \r\nIf you are not currently a member, simply sign up to AlumniConnect. http:\/\/alumni.latrobe.edu.au\/\r\n16:30:24 Travis: did that.\r\n16:30:30 Travis: logged out and in again, still no luck.\r\n16:30:55 Travis: might give it a few hours to catch up and contact you in the morning if it hasn't fixed itself up\r\n16:31:30 Kathy: Might be an idea and in the meantime here is a list of the database accesses for Alumni: http:\/\/latrobe.libguides.com\/content.php?pid=409518&sid=3350635\r\n16:32:54 Travis: ahh - so it's not listed so probably won't be any use to me :-(\r\n16:33:31 Travis: I was looking forward to this being useful but doesn't look like it will be if that's all we get access to. As an infomartion systems guy there's nothing there for me.\r\n16:34:09 Kathy: Yes, there is a limit to the databases Alumni can access. Thanks for your feedback, I will pass it on.\r\n16:34:18 Travis: ta!\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:50:25","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"from Chat related to Alumni access to DBs Sep 1 - Oct 19,2013 via Eva 20\/12","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-09-01 00:00:00","ID":"1003","Feedback":"<p>extracted from Chat related to Alumni access to DBs 1 Sep - 20 Dec 2013 (via email from Eva)\r\n14:51:20 Graeme: Hi. How can I help you?\r\n14:51:28 Adrian Harris: Hi\r\n14:52:12 Adrian Harris: I'm a former Masters student from last year and I have joined the student Alumni, however I cant log into the journal database\r\n14:53:36 Graeme: Due to license restrictions there are only a handful of databses that even with alumni registration you can access\r\n14:53:52 Graeme: See http:\/\/latrobe.libguides.com\/content.php?pid=409518&sid=3350635\r\n14:54:12 Adrian Harris: Can I pay a fee to have greater access\r\n14:54:36 Graeme: No. It is ourside of our license agreements with the database providors. \r\n14:54:56 Adrian Harris: however, I still can't log on\r\n14:55:08 Adrian Harris: to access those databases \r\n14:55:44 Graeme: It does mention on the http:\/\/latrobe.libguides.com\/content.php?pid=409518&sid=3350635 you need to firs authenticate yourself with your Uni ID and LIbrary PIN provided when you became a LIbrary A?lumni memebr. \r\n14:56:00 Adrian Harris: that is not working\r\n14:56:05 Adrian Harris: I have tried that\r\n14:56:32 Adrian Harris: I think i have anyway\r\n14:57:57 Graeme: Maybe ring your home library inquiry desk and they can check your record on the library alumni member database . http:\/\/www.latrobe.edu.au\/library\/contact-us\/library-phone-and-email \r\n14:58:20 Adrian Harris: ok thanks\r\n14:58:55 Graeme: Is there anything else I can help you with?\r\n15:02:23 Graeme has left the chat.\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:51:47","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"extracted from Chat related to Alumni access to DBs 1 Sep - 20 Dec 2013 (via email from Eva) ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-09-01 00:00:00","ID":"1004","Feedback":"<p>extracted from Chat about Alumni access to DBs 1Sep - 20 Dec 2013 (via email from Eva)\r\n12:40:01 Jenny: Hi. How can I help you?\r\n12:40:08 Emily: Hello there! Just a very quick question \r\n12:40:29 Emily: I was wondering - does La Trobe offer library services to Not-for-profits?\r\n12:40:45 Emily: Even if only for one or two resources, not the full range?\r\n12:41:45 Jenny: Hi Emily, The membership categories are here: http:\/\/www.latrobe.edu.au\/library\/borrowing-and-ebooks\/join-the-library\r\n12:41:55 Jenny: And there isn't one for not for profits\r\n12:42:17 Jenny: however members of the public can come in and use the resources in the library\r\n12:42:33 Emily: Hmm, alright. There does seem to be a business \/ community access portal so I may look further into that. Thanks Jenny! \r\n12:42:56 Jenny: or members of the public can access most of the online resources, but have to come into the library and use specific 'visitor' computers\r\n12:43:02 Jenny: Are you a health organisation?\r\n12:43:31 Emily: I was thinking of arranging access to the Macquarie Dictionary for a youth not-for-profit literary organisation\r\n12:43:39 Emily: Online access, preferably \r\n12:43:50 Emily: Just wanted to test the waters and see if that sort of thing was possible!\r\n12:44:28 Jenny: Sorry doesn't seem to be. But another thing, if there are any Alumni in your organisation, there is an area for that.\r\n12:45:04 Emily: Mm, I am Alumni myself, so may look into that as well. Thanks Jenny - hope you have a good day! :)\r\n12:45:26 Jenny: So - only coming into the library and using specific computers - re the Macquarie Dictionary\r\n12:45:55 Jenny: Alumni membership provides remote access to some databases, but not that one. See the page above for the Alumni bit\r\n12:46:01 Jenny: Is there anything else I can help you with?\r\n12:46:16 Emily: No, that's all. Thanks for that!\r\n12:46:23 Jenny: You're welcome\r\n12:46:27 Jenny: Thanks for chatting. Bye.\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:53:25","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"extracted from Chat about Alumni access to DBs 1Sep - 20 Dec 2013 (via email from Eva)","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-09-01 00:00:00","ID":"1005","Feedback":"<p>extracted from Chat related to Alumni access to DBs 1 Sep - 20 december 2013 (via email from Eva)\r\n12:15:55 Steve: Hi. How can I help you?\r\n12:17:09 Annie Dennis: I've recently been given access to library as an alumni member. Can login to search journals etc but can't get to actual articles\r\n12:18:27 Steve: Alumni members only have access to a small number of databases\r\n12:18:34 Steve: http:\/\/latrobe.libguides.com\/content.php?pid=409518&sid=3350635\r\n12:18:53 Steve: The link lists all of thesed databses you have access to\r\n12:19:56 Annie Dennis: Ok I've been trying as if I was still a student. So this suggests it's limited to databases and SAGE journals??\r\n12:20:57 Steve: Yes. You have to autnenticate as a new Alumni member to use the library\/access\r\n12:21:10 Steve: http:\/\/latrobe.libguides.com\/alumni\r\n12:21:26 Steve: The instructions for all info on Alumni membership is on this link\r\n12:22:08 Annie Dennis: Thanks. I thought I'd done that since being Alumni, I'll try again. Thanks for your help. Cheers Annie\r\n12:22:24 Steve: No worries. Is there anything else I can help you with?\r\n12:22:52 Annie Dennis: I'll get back to you if I still can't find what I'm after. Otherwise, no and thanks again\r\n12:23:09 Steve: Thanks for chatting. Bye.\r\n15:58:25 Ian: Hi - how can I help you?\r\n15:58:50 Natalie: HI, i am part of the LaTrobe AluniCOnnect and cant access the library database from home. is there any way to fix this?\r\n15:59:26 Ian: Which database are you trying to connect to?\r\n16:01:13 Natalie: Anything nursing related. I am also trying to search for journal articles. it asks me for my username and password, but then tells me they are incorrect\r\n16:05:09 Ian: There are only a select number of databases which alumni have access to. These are listed on the following page under the Alumni tab: http:\/\/www.latrobe.edu.au\/library\/borrowing-and-ebooks\/join-the-library - the only database listed relevant to nursing is SAGE.\r\n16:05:49 Natalie: thanks for that. is there any way for me to be able to get access to journal articles?\r\n16:06:25 Ian: Otherwise, the state libraries of Vic & NSW enable access to their databases once you've signed up - these can then be accessed for free from your home.\r\n16:06:50 Natalie: Thank you for your help Ian.\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:54:42","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"extracted from Chat related to Alumni access to DBs 1 Sep - 20 december 2013 (via email from Eva) ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-09-01 00:00:00","ID":"1006","Feedback":"<p>extracted from Chat related to alumni access to DBs 1 Sep - 20 Dec 2013 (via mail from Eva)\r\n(A COMPLIMENT FOR YOU)\r\n14:02:07 Katie: Hi Janna\r\n14:02:14 Katie: Sorry Joanna\r\n14:03:11 Joanna Richardson: Hi; I work in the Library Executive at Griffith University. Just wished to know whether the electronic access to the 5 databases which you provide to your alumni give them off-campus access. Thanks\r\n14:05:26 Katie: Yes, the 5 databases are available off campus with a username and password\r\n14:07:06 Katie: We have also recently made alumni membership free.\r\n14:07:07 Joanna Richardson: Great! Thanks. I think our VC must have seen the recent announcement about your alumni having free library membership ;-) So I have been tasked with finding out what they get in the way of e-access! We are trying to develop as clean and neat a system at Griffith as y'all have done\r\n14:07:53 Katie: :) thanks for the feedback. Good luck \r\n14:08:00 Joanna Richardson: :-)\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:56:14","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"extracted from Chat related to alumni access to DBs 1 Sep - 20 Dec 2013 (via mail from Eva)","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1007","Feedback":"<p>received via Kerryn LRC Mildura survey dec 2013\r\nLonger borrowing period on books that are unrequested by others would be helpful.<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:50:42","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn LRC Mildura survey dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1008","Feedback":"<p>received via Kerryn Mildura LRC survey Dec 2013\r\nI usually bring my laptop to ensure I have a computer to use as sometimes the library computers are all taken (student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:52:17","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn Mildura LRC survey Dec 2013 ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1009","Feedback":"<p>received via Kerryn LRC Mildura survey Cec 2013\r\nCould we get a few more power points around the building.Its been difficult finding an unused power point for my laptop when I need it. My laptop does not stay charged so it needs to be connected to a powersource and sadly there are too few computers in library.(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:53:39","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn LRC Mildura survey Dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1010","Feedback":"<p>received via Kerryn LRC Mildura survey Dec 2013\r\nSometimes not all of the staff are familiar with the Latrobe University processes.(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:55:25","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn LRC Mildura survey Dec 2013 ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1012","Feedback":"<p>received via Kerryn Mildura LRC survey Dec 2013\r\nI wish more student would use this facility (student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:57:06","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn Mildura LRC survey Dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1013","Feedback":"<p>received via Kerryn - LRC Mildura survey Dec 2013\r\nI benefited greatly having the library open on a sunday!(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 17:59:47","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn - LRC Mildura survey Dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1014","Feedback":"<p>received via Kerryn LRC Mildura survey Dec 2013\r\nThe library service has always been extremely useful and helpful to meet my needs in the many years that I have been studying and using this library.(Library and bookshop) (student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:01:03","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn LRC Mildura survey Dec 2013 ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1015","Feedback":"<p>received via Kerryn Mildura LRC survey Dec 2013\r\nThrough my 4 years of study as a La Trobe Student I have definitly utilized the Library many many times. I have always had the right resources and the staff have always been approachable! Especially our Librarian Maureen Speed who's enthusiasm and approachable nature makes using the library a positive experience.(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:03:20","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn Mildura LRC survey Dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1016","Feedback":"<p>received via Kerryn - Mildura LRC survey Dec 2013\r\n\r\nNo, thank you for providing a great library that I am able to complete assignments in time.(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:05:02","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn - Mildura LRC survey Dec 2013 ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1017","Feedback":"<p>received via Kerryn LRC Mildura survey Dec 2013\r\nLove our sunitafe library :)(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:09:49","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn LRC Mildura survey Dec 2013","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2013-12-01 00:00:00","ID":"1018","Feedback":"<p>received via Kerryn Mildura LRC survey Dec 2013\r\nGreat staff that are ready to help and very approachable. On occasions there may be no computers free, but very rarely.(student)<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:12:44","Campus":"5","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn Mildura LRC survey Dec 2013 ","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-02-07 00:00:00","ID":"1019","Feedback":"<p>received via email from Eva after her reply - alumni access to DBs\r\n'I was quite thrilled to learn that Alumni could now access the library from off campus.  Now quite disappointed to see what a useless range of journals are available.  Why is this so?'\r\n \r\nregards\r\n \r\nTim Barlow \r\nEcologist\r\nRiver Health Program \r\nGoulburn Broken CMA \r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:28:32","Campus":"6","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via email from Eva after her reply","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-03 00:00:00","ID":"1020","Feedback":"<p>received via Kerryn after she had answered - Access to Library\/Internet \r\n'To Whom It May Concern,\r\n\r\nI am a first year student who has had to relocate to attend Latrobe Uni Bendigo.  I have not yet been able to organise internet at my new residence.\r\n\r\nAt O Week we were advised that there were a number of things that we needed to do before class started in the first week, including a Quiz which was part of our assessment, and that all information will be on the LMS.\r\n\r\nOn the weekend I came to Latrobe Uni Bendigo, I was unable to access the library, printing facilities or power for my computer.  The public library was only open till 1 on Saturday.\r\n\r\nI had some difficulties accessing the Wifi outside of the building and the sunny weather made it difficult for me to view my computer screen.  While sitting outside using the Wifi I noticed a number of students trying to access the building to use the facilities.\r\n\r\nThankfully the required assessment was waived due to issues with the LMS system.  If it was not then I would not have been able to complete this on time.\r\n\r\nI understand the need for asking students to start preparing before the first week of class, however the tools for preparing were not accessible.\r\n\r\nI would request that next year the weekend between O week and first week that the library be accessible so that students can do what is required of them.'\r\n\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:18:22","Campus":"2","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"received via Kerryn after she had answered","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-04 00:00:00","ID":"1021","Feedback":"<p>from Eva via email - unavailability of previously used VHS videos for teaching:\r\nFrom: Eva Fisch \r\nSent: Friday, 7 March 2014 9:52 AM\r\nTo: Dorota Pudlowski\r\nCc: Kerryn Amery; Geoff Payne\r\nSubject: add to Library feedback system\r\n\r\n\r\nHi Dorota,\r\n\r\nI am copying the following email string to you so you can add it to the Library feedback system.  Please read from the bottom up.  It is a complaint about our VHS withdrawals .\r\n\r\nI spoke to Diane Kirkby yesterday morning and explained \r\nâ€¢\tYes materials were withdrawn as the Library is converting recently used materials to DVD or streaming formats (VHS is a superseded format and equipment is no longer able to be obtained or serviced), \r\nâ€¢\tThat the majority of her materials fell into that category and have been replaced by DVD  (noting how she can find them), \r\nâ€¢\tHow she can take this opportunity to use streamed video and clips and playlists in lectures to â€œadd sound and actionâ€\u009d in online teaching â€“ she seemed keen and asked for training and I directed her to our new video streaming help on the Library web and to her LRS team.\r\n\r\nThe three items she mentions have been actioned , with one already on the shelves in DVD format.\r\n\r\nI am working on some video clipping  exemplars in my Moodle sandpit \r\n-to understand the barriers academics are having in that environment \r\n-these can also be used to show academics how to enhance online teaching.\r\n\r\nFionaâ€™s team will be able to incorporate these examples into online \/ on demand training.\r\n\r\n\r\nEva\r\n\r\nEva Fisch\r\nCollection Development Manager\r\n\r\n\r\n-----Original Message-----\r\nFrom: Diane Kirkby \r\nSent: Tuesday, 4 March 2014 9:58 PM\r\nTo: Eva Fisch\r\nSubject: RE: teaching material withdrawn\r\n\r\nHi Eva,\r\nI won't be in tomorrow as it's my research day but I'll be at home, on 9890 8717, if  you could call me.\r\n\r\nThe videos that have been removed (that I have been using regularly for many years) seem not to be easily available.\r\nThey are documentaries:\r\n1.The Marriage of Pocahontas  (1995)\r\n2.Jefferson's Blood (PBS, 2000 ) - I don't believe this has been released as a DVD\r\n\r\nOthers on my list as VHS format seem to have been replaced by DVD's which I find much less useful for lecturing so I regret this change but at least I can still (try to) show them.\r\n\r\n3. And one (500 Nations) seems to have been on order \/in process as a DVD since Sept. 2013. I am interested in Episode 6\r\n\r\nI don;t know about streaming, but I do know that our lecture theatres have been equipped to play YouTube without any sound, so not a satisfactory substtute for the videos.\r\n\r\nIt is deeply concerning that we were not consulted about  or even informed about this decision. I do hope something can be done.\r\n\r\nDiane\r\n\r\n________________________________________\r\nFrom: Eva Fisch\r\nSent: Tuesday, March 04, 2014 4:04 PM\r\nTo: Diane Kirkby\r\nSubject: Re: teaching material withdrawn\r\n\r\nHi Dianne,\r\nOf course, when would suit you? Tomorrow morning?\r\nCan you reconstruct what titles you need?, perhaps they are available in a streamed, online format?\r\n\r\nBest wishes\r\nEva\r\n\r\nSent from my iPad\r\n\r\n> On 4 Mar 2014, at 3:15 pm, \"Diane Kirkby\" <Diane.Kirkby@latrobe.edu.au> wrote:\r\n>\r\n> Dear Eva,\r\n>\r\n> I have just discovered -when I turned up at the Library to collect my teaching materials for this semester - that the videos I use have been withdrawn.\r\n>\r\n> This it was seems is a decision that was made without consultation, or any prior warning to the teaching staff, and despite the fact that the subject was last taught in sem.2 2012.\r\n> I find this deeply distressing, and extremely inconvenient for my teaching delivery this semester.\r\n>\r\n> Can we please make a time to discuss it?\r\n>\r\n> Diane Kirkby\r\n> Ext.2379\r\n<\/p>","Response":"","PermissionToPost":"0","ResponseDate":"2014-03-20 18:15:16","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"from Eva via email","AllocatedToId":"23","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-20 22:36:01","ID":"1022","Feedback":"Hi could you please fix the ART for referencing as it is hard to see the last step as it drops it into the bottom corner thanks","Response":"","PermissionToPost":"1","ResponseDate":"0000-00-00 00:00:00","Campus":"2","Name":"Jullia ","Email":"jcpeck@students.latrobe.edu.au","Telephone":"","Responded":"0","Notes":null,"AllocatedToId":"2","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-22 13:01:29","ID":"1023","Feedback":"Last year's method felt safer... I don't really like the idea of anyone being able to walk into the library till 10 pm (it's a little late). Closing the library for extended at 6 was a little early, how about 7 or 8? ","Response":"<p>No response required.<\/p>","PermissionToPost":"0","ResponseDate":"2014-03-24 11:20:49","Campus":"3","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-24 07:34:36","ID":"1024","Feedback":"16BWSv piece , &lt;a href=&quot;http:\/\/knopych.com&quot;&gt;garcinia cambogia extract benefits&lt;\/a&gt;, [url=http:\/\/knopych.com]garcinia cambogia extract benefits[\/url], http:\/\/knopych.com garcinia cambogia extract benefits,  646, &lt;a href=&quot;http:\/\/redassedbaboon.com&quot;&gt;http:\/\/helenmccrory.org\/&lt;\/a&gt;, [url=http:\/\/redassedbaboon.com]http:\/\/helenmccrory.org\/[\/url], http:\/\/redassedbaboon.com http:\/\/helenmccrory.org\/,  :-), ","Response":"","PermissionToPost":"1","ResponseDate":"2014-03-24 11:18:14","Campus":"14","Name":"Cwqtndim","Email":"","Telephone":"","Responded":"1","Notes":"spam. no response","AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-24 12:24:51","ID":"1025","Feedback":"I have an online class on Thursday evenings at 7pm and it would be useful if the library was open past 7pm as myself and other students could use the group study rooms to watch the online lecture.","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp;I have a few questions.<\/p>\r\n<p>What is the subject code for your class?&nbsp;Is your class every Thursday evening?&nbsp;&nbsp;How many Wodonga students attend the class?&nbsp;What is the duration of your class - one hour?&nbsp;&nbsp;Is your class recorded and available to be viewed at another time?&nbsp; You have the option to answer these questions via feedback or by emailing me.&nbsp; Alternatively, you can ring me on 94791928.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-25 10:23:44","Campus":"1","Name":"Amy Foster","Email":"18098985@students.latrobe.edu.au","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-24 17:12:30","ID":"1026","Feedback":"I am concerned that our opening hours may not return to closing at 9pm Monday to Thursday. 12 students have queried this with me in the past two weeks because they are upset that we close at 7pm. I have advised them to entertheir comments on this forum but am not sure that they have done so. Closing at 7pm is a clear reduction in service to the students on this campus and fails to meet the &quot;equity&quot; test for our students in comparison to students at Bundoora and Bendigo.","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback.&nbsp; Please encourage AW&nbsp;students to enter their feedback so that we can obtain a better understanding of their concerns.&nbsp;Alternatively, they&nbsp;email&nbsp;their concerns to&nbsp;me or&nbsp;to the&nbsp;Wodonga&nbsp;Library manager.&nbsp; The Library has undertaken a review of Library opening hours based on 2013 usage statistics (queries, numbers of students in the building) and feedback.&nbsp; The results of the review will be announced soon.<\/p>\r\n<p>La Trobe provides physical Library services at&nbsp; five campuses.&nbsp;Opening hours vary across these sites.&nbsp;&nbsp;Shepparton and Mildura (co-located with TAFE)&nbsp;library buildings and services&nbsp;close at 6.00 pm - weekdays.&nbsp; Currently, Library services cease at 7.00 pm at Wodonga, Bendigo and Melbourne on weekdays.&nbsp; The Bendigo and Melbourne library buildings open as a study&nbsp;space between 7.00 pm and midnight.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>\r\n<p>&nbsp;<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-25 10:35:48","Campus":"1","Name":"Kristine Coyle","Email":"k.coyle@latrobe.edu.au","Telephone":"X 9745","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"1","UserIP":null},{"Date":"2014-03-25 08:48:40","ID":"1027","Feedback":"Reading others' feedback is helpful, but it would be more so if the response (at least) was dated. Also the option to sort by campus would make the information more relevent to the reader.","Response":"<p>Hello,<\/p>\r\n<p>Thank you for your feedback and suggestions which I have forwarded to the staff member who designed and maintains the feedback database.&nbsp; He will investigate your suggestions.<\/p>\r\n<p>For your information, feedback is usually answered within 24 hours and&nbsp;frequently on the same day.&nbsp; Feedback submitted on the weekend is often not answered until Monday morning. This delayed response time for weekend feedback is under review.<\/p>\r\n<p>The Library team is conscious that students utilise feedback to report problems that require prompt attention.&nbsp; Staff routinely check feedback throughout the day Monday - Friday and respond as quickly as possible.&nbsp;<\/p>\r\n<p>Sometimes feedback is about an issue that requires some investigation such as a technical issue with a library resource, a complaint about a library service or a matter that needs referral such as a building problem.&nbsp; Where possible, we&nbsp;advise the student who submitted the feedback that we are investigating their issue and will keep them updated of progress, particularly if the issue takes some&nbsp;weeks or even months to resolve.&nbsp; Having the student's email address makes this process easier but we understand that some students prefer to remain anonymous when submitting feedback.<\/p>\r\n<p>Sometimes a staff member will ring a student, if the telephone number has been provided,&nbsp;to find out more about their feedback and their suggestions for improvements.&nbsp; The Library team value opportunities to work collaboratively with students on addressing service or resource issues and developing improvements.<\/p>\r\n<p>Best wishes,<\/p>\r\n<p>Kerryn Amery, Associate University Librarian - Information Services<\/p>","PermissionToPost":"1","ResponseDate":"2014-03-25 10:54:58","Campus":"1","Name":"","Email":"","Telephone":"","Responded":"1","Notes":"","AllocatedToId":"5","PostedOnline":"1","EmailedResponse":"0","UserIP":null},{"Date":"2014-03-25 12:15:41","ID":"1028","Feedback":"It is not uncommon to bear witness to a constant decline of the academic standards from within this library, and university more generally, but having the postgrad study room reduced to loud consultations has rendered the last of very few available silent study spaces in operable. \r\nI dislike feeling polarised by being the voice to remonstrate this point.   Nor do I feel this is the 'good student's' responsibility.\r\n\r\nPlease could you remedy this situation, perhaps by re-categorising the space as 'silent study', and putting up signage accordingly?\r\n\r\nAfter all, I am here to learn, not socialise.  It seems LaTrobe University needs to be reminded of the difference. ","Response":"","PermissionToPost":"1","ResponseDate":"0000-00-00 00:00:00","Campus":"3","Name":"Cameron Scott","Email":"cr3scott@students.latrobe.edu.au","Telephone":"0415614911","Responded":"0","Notes":null,"AllocatedToId":"5","PostedOnline":"0","EmailedResponse":"0","UserIP":null}]